Revit 2027 API
EnergyAnalysisSurface.GetAdjacentAnalyticalSpace Method
 Gets the secondary adjacent analytical space this surface is associated with.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public EnergyAnalysisSpace GetAdjacentAnalyticalSpace()
Public Function GetAdjacentAnalyticalSpace As EnergyAnalysisSpace
public:
EnergyAnalysisSpace^ GetAdjacentAnalyticalSpace()
member GetAdjacentAnalyticalSpace : unit -> EnergyAnalysisSpace
Return Value
EnergyAnalysisSpace
 The secondary analytical space.
Remarks
 An exterior surface will only have one space adjacency.
See Also
Reference
EnergyAnalysisSurface Class
Autodesk.Revit.DB.Analysis Namespace